results/spring-quarkus-perf-comparison/2025-11-18_19-57-10/wrk-spring3-native-2.log
Running 30 test @ http://localhost:8080/fruits
  16 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.71ms    5.98ms  78.12ms   79.79%
    Req/Sec   8616.37    161.57  8937.00     73.33
  258491 requests in 30.007s, 206.60MB read
Requests/sec: 8614.36
Transfer/sec:   6.88MB
Socket errors: connectionErrors 2516, requestTimeouts 0